A = [0]*45
A[0] = 1
for i in range(1, 45):
    A[i] = A[i-1] + 4*i

def area(tr, tc, K):
    jib = 0
    for dr in range(-K, K+1):
        width = K - abs(dr)
        for dc in range(-width, width+1):
            cr = tr + dr
            cc = tc + dc
            if (0<=cr<N) and (0<=cc<N):
                if grid[cr][cc]:
                    jib += 1
    return jib


T = int(input())
for tc in range(1, T+1):
    N, M = map(int, input().split())
    grid = []
    cnt = 0
    for _ in range(N):
        temp = list(map(int, input().split()))
        cnt += temp.count(1)
        grid.append(temp)
    ans = 0
    for nr in range(N):
        for nc in range(N):
            K = 0
            while A[K] <= ans:
                K += 1
            while True:
                temp = area(nr, nc, K)
                if temp*M >= A[K]:
                    ans = max(ans, temp)
                if cnt*M < A[K+1]:
                    break
                K += 1
    print(f'#{tc} {ans}')
    





"""
2. 도시의 크기 N은 5 이상 20 이하의 정수이다. (5 ≤ N ≤ 20)

3. 하나의 집이 지불할 수 있는 비용 M은 1 이상 10 이하의 정수이다. (1 ≤ M ≤ 10)

4. 홈방범 서비스의 운영 비용은 서비스 영역의 면적과 동일하다.

5. 도시의 정보에서 집이 있는 위치는 1이고, 나머지는 0이다.

6. 도시에는 최소 1개 이상의 집이 존재한다.

* 도시를 벗어난 영역에 서비스를 제공해도 운영 비용은 변경되지 않는다.

출력해야 할 정답은 손해를 보지 않으면서 홈방범 서비스를 가장 많은 집들에 제공하는 서비스 영역을 찾았을 때,

그 때의 서비스를 제공 받는 집들의 수이다.

3
8 3
0 0 0 0 0 1 0 0
0 1 0 1 0 0 0 1
0 0 0 0 0 0 0 0
0 0 0 1 0 1 0 0
0 0 1 1 0 0 0 0
0 0 0 0 0 0 0 0
0 0 0 0 1 0 1 0
1 0 0 0 0 0 0 0
7 7
0 0 0 1 0 0 0
0 0 0 0 0 0 0
0 0 0 0 0 0 0
1 0 0 0 0 0 1
0 0 0 0 0 0 0
0 0 0 0 0 0 0
0 0 0 1 0 0 0
10 5
0 0 0 0 0 0 0 0 0 0
0 0 1 0 0 0 0 0 1 1
0 0 0 0 0 1 0 0 1 0
0 0 0 0 0 1 1 0 0 0
0 1 0 0 0 0 0 0 0 1
1 0 0 1 1 1 0 0 0 0
0 1 0 1 0 1 0 0 0 1
0 0 0 0 0 0 1 0 0 1
0 0 1 1 0 0 0 0 0 0
0 0 0 1 0 0 1 1 0 0

정답 조건이 좀 중요해보이는데
1. 손해가 아닐것
2. 그 중 가장 많은 집에 서비스 영역을 제공하는 경우일것
3. 정답은 그때의 집 수임
M은 그니까 1번 조건 검사할때만 쓰이고 진짜 정답은 집 수와 관련이있음

그냥 싹다 탐색해서 조건에 맞는 값 구하면 되는거니까 복잡한 재귀는 필요없는문제임

모든칸에서 K 늘려가면서 탐색하면서 최댓값 갱신하면 될거같은데
K 범위가 상당히 중요해보임
운영 비용 = K**2 + (K-1)**2 인데
수열로 나타내면 
A[0] = 1
A[i] = A[i-1] + 4*i 임
나열하면 1 5 13 25 ...

가지치기 할 수 있는 가능성이 ㅈㄴ많음 그냥
제일 간단해보이는건 일단 그리드 내의 전체 집 수를 다 세놨다가 범위넓히는중에 감지된 집수==전체집수 되면 스탑
근데 만약에 M이 4인데 K를 1늘렸을때 비용이 20 늘어나고 남은 집수가 1이다 하면 더 볼 필요 없잖음 그니깐 남은 집수*M < (K+1)*4 면 더 볼필요없는거 (가지치기 A)

만약에 이미 최댓값이 1 이상이면 K=0 볼 필요없고 5 이상이면 K=1 볼 필요없고 ... 가지치기도 가능해보임 (가지치기 B)

area함수가 마름모 범위 탐색해주면서 범위 내 집 수 알려주도록 만들거임
마름모 범위를 어떻게 탐색하느냐? 마름모 12시방향 꼭짓점에서 내려오면서 행에따라 폭이 변하는 탐색범위를 만들면됨<이게 어려움

그리드 한칸한칸 다 순회해서 볼때 
1. 어떤 K에서 이득 봤으면 ans 갱신해야함
2. 갱신후 A가지치기에서 걸리는지 확인
3. K값 1증가

한칸을 다 보고나면 / 한칸 보기전에
가지치기 B를 실행해야함
지금 ans가 A수열 몇번째 인덱스 사이인지 알아내서 그걸 K초기값으로 쓰면됨
그럼 이걸 이진탐색으로 찾아낼까? ㅋㅋ 배보다 배꼽이 큰거아닌가 어차피 K범위 최대 40언저리니까 걍 대충만듬

근데 하고나니깐 A가지치기 하면 지금까지의 누적 이익이 앞으로의 손해를 감당하다가 갑자기 집이 많이나와서 생기는 반례가 있었음
그래서 그냥 이 그리드에서 얻을수있는 최대수익보다 K를 1늘리면 발생할 비용이 크면 break하게 만듬
"""
