def area(tr, tc, K):
    
    pass

def go(nr, nc):
    pass

T = int(input())
for tc in range(1, T+1):
    N, M = map(int, input().split())
    grid = []
    for _ in range(N):
        grid.append(list(map(int, input().split())))
    





"""
2. 도시의 크기 N은 5 이상 20 이하의 정수이다. (5 ≤ N ≤ 20)

3. 하나의 집이 지불할 수 있는 비용 M은 1 이상 10 이하의 정수이다. (1 ≤ M ≤ 10)

4. 홈방범 서비스의 운영 비용은 서비스 영역의 면적과 동일하다.

5. 도시의 정보에서 집이 있는 위치는 1이고, 나머지는 0이다.

6. 도시에는 최소 1개 이상의 집이 존재한다.

* 도시를 벗어난 영역에 서비스를 제공해도 운영 비용은 변경되지 않는다.

출력해야 할 정답은 손해를 보지 않으면서 홈방범 서비스를 가장 많은 집들에 제공하는 서비스 영역을 찾았을 때,

그 때의 서비스를 제공 받는 집들의 수이다.

3
8 3
0 0 0 0 0 1 0 0
0 1 0 1 0 0 0 1
0 0 0 0 0 0 0 0
0 0 0 1 0 1 0 0
0 0 1 1 0 0 0 0
0 0 0 0 0 0 0 0
0 0 0 0 1 0 1 0
1 0 0 0 0 0 0 0
7 7
0 0 0 1 0 0 0
0 0 0 0 0 0 0
0 0 0 0 0 0 0
1 0 0 0 0 0 1
0 0 0 0 0 0 0
0 0 0 0 0 0 0
0 0 0 1 0 0 0
10 5
0 0 0 0 0 0 0 0 0 0
0 0 1 0 0 0 0 0 1 1
0 0 0 0 0 1 0 0 1 0
0 0 0 0 0 1 1 0 0 0
0 1 0 0 0 0 0 0 0 1
1 0 0 1 1 1 0 0 0 0
0 1 0 1 0 1 0 0 0 1
0 0 0 0 0 0 1 0 0 1
0 0 1 1 0 0 0 0 0 0
0 0 0 1 0 0 1 1 0 0

정답 조건이 좀 중요해보이는데
1. 손해가 아닐것
2. 그 중 가장 많은 집에 서비스 영역을 제공하는 경우일것
3. 정답은 그때의 집 수임
M은 그니까 1번 조건 검사할때만 쓰이고 진짜 정답은 집 수와 관련이있음

모든칸에서 K 늘려가면서 탐색하면서 최댓값 갱신하면 될거같은데
K 범위가 상당히 중요해보임
운영 비용 = K**2 + (K-1)**2 인데
수열로 나타내면 
A[0] = 1
A[i] = A[i-1] + 4*i 임
나열하면 1 5 13 25 ...

가지치기 할 수 있는 가능성이 ㅈㄴ많음 그냥
제일 간단해보이는건 일단 그리드 내의 전체 집 수를 다 세놨다가 범위넓히는중에 감지된 집수==전체집수 되면 스탑
근데 만약에 M이 4인데 K를 1늘렸을때 20 늘어나고 남은 집수가 1이다 하면 더 볼 필요 없잖음 그니깐 남은 집수*M < (K+1)*4 면 더 볼필요없는거임

만약에 이미 최댓값이 1 이상이면 K=1 볼 필요없고 5 이상이면 K=2 볼 필요없고 ... 가지치기도 가능해보임

area함수가 마름모 범위 탐색해주면서 바로 손/익 여부 계산하고 범위 내 집 수까지 알려주도록 만들거임
마름모 범위를 어떻게 탐색하느냐? abs(r-nowr)+abs(c-nowc)가 k이하인 칸들이 범위임<근데 이건 너무 비효율적인 탐색법임

"""
